module.exports = {
	extension: {
		'在线更新': {
			version: '1.46',
			author: '诗笺',
			intro: '用于更新无名杀版本，<span style="color: red;">基本实现0崩溃</span>。',
		},
		'SJ Settings': {
			version: '1.3',
			author: '诗笺',
			intro: '诗笺版（安卓）无名杀自带的SJ Settings扩展是用于导入“从其他应用使用无名杀打开的扩展包”，请勿删除<span style="color: red;">注：从1.26版本起，扩展版本最好和app版本对应</span>',
		},
		'全能搜索': {
			version: '2.15',
			author: '诗笺',
			intro: '用于在游戏内便捷地搜索各种武将,技能和相应代码',
		},
		'阳光包': {
			version: '5.8.21',
			author: '阳光微凉',
			intro: '是优质的原创三国武将扩展',
		},
		'十周年UI': {
			// 美化扩展应只适合当前的无名杀版本
			nonameVersion: '1.9.116.3',
			version: '1.2.0.220114.17',
			author: '短歌(寰宇星城, Show-K代更)',
			intro: '是最主流的美化扩展，能让无名杀的操作界面更像三国杀，也是许多特效，美化的基础',
		},
		'千幻聆音': {
			version: '4.0.2',
			author: '寰宇星城',
			intro: '换肤换音扩展，提供美化的武将个人资料页功能',
		},
		'云将': {
			version: '8.73.93',
			author: '柚子丶奶茶丶猫',
			intro: '【云将】扩展的精简版',
		},
		'Thunder': {
			version: '3.33',
			author: '雷',
			intro: '本扩展主要内容为三国杀十周年最新武将（无名杀本体暂未更新的武将），并涵盖部分十周年风格的UI美化。',
		},
		'大乱桌斗': {
			version: '2.1.8',
			author: 'Show-K',
			intro: '《大乱桌斗LITE》（原《大乱斗杀》）是《任天堂明星大乱斗》同人无名杀扩展，由《大乱桌斗》同人游戏移植而来，不隶属于<i>任天堂</i>、<i>Sora</i>和其他相关公司。'
		},
		// '天牢令': {
		// 	version: '10.20',
		// 	author: 'Al₂O₃·3H₂Oฅฅ*（2HAlO₂·H₂Oฅฅ*）',
		// 	intro: '大部分是原本技能加强武将，主要是给天牢武将（和部分私货武将）做加强同时也有重置武将和原创武将。如有bug，请加扩展交流群（644189851）反馈。'
		// }
		'合纵抗秦': {
			version: '1.7',
			author: '烟雨墨染&苏婆玛丽奥',
			intro: 'OL的合纵抗秦模式，现在由诗笺维护更新'
		}
	}
};