module.exports = {
	extension: {
		'在线更新': {
			version: '1.62',
			author: '诗笺',
			intro: '用于更新无名杀版本，<span style="color: red;">基本实现0崩溃</span>。<br>注: 第一次安装游戏请解压完整包后再用此扩展检查更新',
		},
		'SJ Settings': {
			version: '1.4204',
			author: '诗笺',
			intro: '诗笺版（安卓）无名杀自带的SJ Settings扩展是用于导入“从其他应用使用无名杀打开的扩展包”，请勿删除',
		},
		'全能搜索': {
			version: '3.4',
			author: '诗笺',
			intro: '用于在游戏内便捷地搜索各种武将,技能和相应代码',
		},
		'阳光包': {
			version: '5.8.21',
			author: '阳光微凉',
			intro: '是优质的原创三国武将扩展',
		},
		'十周年UI': {
			// 美化扩展应只适合当前的无名杀版本
			// TODO: 版本号最前面可以用+号代表最低支持版本
			nonameVersion: '1.10.3.1',
			version: '1.2.0.220114.36',
			author: 'Show-K←寰宇星城←disgrace2013←短歌 QQ464598631',
			intro: '是最主流的美化扩展，能让无名杀的操作界面更像三国杀，也是许多特效，美化的基础',
		},
		'千幻聆音': {
			version: '4.0.3',
			author: '寰宇星城',
			intro: '换肤换音扩展，提供美化的武将个人资料页功能',
		},
		'云将': {
			version: '8.73.93',
			author: '柚子丶奶茶丶猫',
			intro: '【云将】扩展的精简版',
		},
		'Thunder': {
			version: '3.33',
			author: '雷',
			intro: '本扩展主要内容为三国杀十周年最新武将（无名杀本体暂未更新的武将），并涵盖部分十周年风格的UI美化。',
		},
		'大乱桌斗': {
			version: '2.1.12',
			author: 'Show-K',
			intro: '《大乱桌斗LITE》（原《大乱斗杀》）是《任天堂明星大乱斗》同人无名杀扩展，由《大乱桌斗》同人游戏移植而来，不隶属于任天堂、Sora和其他相关公司。'
		},
		// '天牢令': {
		// 	version: '10.20',
		// 	author: 'Al₂O₃·3H₂Oฅฅ*（2HAlO₂·H₂Oฅฅ*）',
		// 	intro: '大部分是原本技能加强武将，主要是给天牢武将（和部分私货武将）做加强同时也有重置武将和原创武将。如有bug，请加扩展交流群（644189851）反馈。'
		// }
		'合纵抗秦': {
			version: '1.7',
			author: '烟雨墨染&苏婆玛丽奥',
			intro: 'OL的合纵抗秦模式，现在由诗笺维护更新'
		},
		'桌面大战': {
			version: '2',
			author: 'Show-K',
			intro: '一个基于《桌面大战》（《火柴人VS动画师》）系列的同人《无名杀》扩展，不隶属于Alan Becker等相关创作者。'
		}
	}
};